src/cf/src/InformationRegisters/ТелеграмНастройкиБотов/ТелеграмНастройкиБотов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТелеграмНастройкиБотов</name>
  <resources>
    <name>Смещение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Бот</name>
    <type>
      <types>CatalogRef.ТелеграмБоты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ТелеграмНастройкиБотов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СохранитьНастройкиБота(НакопленныеДанные) Экспорт
	
	Бот = НакопленныеДанные.ДанныеБота.Бот;
	ИдентификаторОбновления = НакопленныеДанные.ИдентификаторОбновления;
	
	Если ТипЗнч(ИдентификаторОбновления) = Тип("Число") Тогда
		МенеджерЗаписи = РегистрыСведений.ТелеграмНастройкиБотов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Бот 		= Бот;
		МенеджерЗаписи.Смещение = ИдентификаторОбновления;
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
